// See https://aka.ms/new-console-template for more information
//Арифметические операции
int n1 = 3;
int n2 = 8;

//Операция сложения
int r1 = n1 + n2; //r1=11

//Операция вычитания
int r2 = n2 - n1; //r2=5

//Операция умножения
int r3 = n2 * n1; //r3=24

//Операция деления
int r4 = n2 / n1; //r4=2
double r5 = (double) n2 / n1; //r5=2.6666666666666665
double r6 = n2 / n1; //r6 = 2

//Операция взятия остатка
double x = 12.0;
double z = x % 5.0; //z=2

//Унарные операции
//Операция инкремента
//Префиксный инкремент
int y1 = 2;
int x1 = ++y1;
Console.WriteLine($"{y1} -> {x1}");
//Постфиксный инкремент
int y2 = 6;
int x2 = y2++;
Console.WriteLine($"{y2} -> {x2}");

//Операция декремента
//Префиксный декремент
int z1 = 8;
int w1 = --z1;
Console.WriteLine($"{z1} -> {w1}");
//Постфиксный декремент
int z2 = 4;
int w2 = z2--;
Console.WriteLine($"{z2} -> {w2}");

//Порядок операций
//1. - Инкремент, декремент
//2. - Деление, умножение, взятие остатка
//3. - Сложение, вычитание

//Изменение порядка операций (используем скобки)
int a = 2;
int b = 7;
int c = 9;
int d = c---b * a; //a=2 b=7 c=9 d=-5
int d2 = (c-(--b)) * a;
Console.WriteLine($"{d2}"); //a=2 b=6 c=8 d=4

int d3 = 10 / 5 * 2; //10 / 5 * 2 эквивалентно (10 / 5) * 2 d3=4